In [1]:
# Add MatPlotLib inline magic command 

%matplotlib inline

#Dependencies and Setup 

import matplotlib.pyplot as plt 
import numpy as np 
import pandas as pd

In [2]:
# Files to load 

city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

city_data_df = pd.read_csv(city_data_to_load)

city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [3]:
# Read the ride data file and store it in a pandas DataFrame. 

ride_data_df = pd.read_csv(ride_data_to_load)

ride_data_df.head(10)

                 city           date   fare        ride_id
0  Lake Jonathanshire  1/14/19 10:14  13.83  5739410000000
1  South Michelleport   3/4/19 18:24  30.24  2343910000000
2  Port Samanthamouth   2/24/19 4:29  33.44  2005070000000
3          Rodneyfort  2/10/19 23:22  23.44  5149250000000
4          South Jack    3/6/19 4:28  34.58  3908450000000
5        South Latoya  3/11/19 12:26   9.52  1995000000000
6       New Paulville  2/27/19 11:17  43.25   793208000000
7        Simpsonburgh   4/26/19 0:43  35.98   111954000000
8     South Karenland    1/8/19 3:28  35.09  7995620000000
9       North Jasmine    3/9/19 6:26  42.81  5327640000000

In [4]:
# Get the columns and the rows that are not null. 

city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [5]:
# Get the columns and the rows that are not null. 

city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [6]:
# Get the data types of each column. 

city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [7]:
# Get the unique values of the type of city. 

city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [8]:
# Get the number of data points from the Urban cities. 

sum(city_data_df["type"] == "Urban")

66

In [9]:
# Get the number of data points from the Suburban and Rural cities. 

suburban = sum(city_data_df["type"] == "Suburban")
rural = sum(city_data_df["type"] == "Rural")

print(f"{suburban} & {rural}")

36 & 18

In [10]:
# Get the rows and columns that are not null from ride_data_df

ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [11]:
# Get the rows and columns that are not null 

ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [12]:
# Get the data type from each column

ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [13]:
# When we merge two dataframes, we merge on a column with the same dat, and the same column name, 
# in both dataframes. 
# new_df = pd.merge(leftdf, rightdf, on = ["column_leftdf", column_rightdf])

In [14]:
# Combine the data into a single dataset. 
pyber_data_df = pd.merge(ride_data_df, city_data_df, how = "left", on = ["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/19 10:14,13.83,5739410000000,5,Urban
1,South Michelleport,3/4/19 18:24,30.24,2343910000000,72,Urban
2,Port Samanthamouth,2/24/19 4:29,33.44,2005070000000,57,Urban
3,Rodneyfort,2/10/19 23:22,23.44,5149250000000,34,Urban
4,South Jack,3/6/19 4:28,34.58,3908450000000,46,Urban